# Завдання 1. Вивести на екран привітання "Hello, world!".
print("Hello, World!")

# Завдання 2. Обчислити суму двох чисел і вивести результат.
# 1 етап: Введення двох чисел користувачем
num1 = float(input("Введіть перше число: "))
num2 = float(input("Введіть друге число: "))
# 2 етап: Обчислення суми
sum_result = num1 + num2
# 3 етап: Вивести результат
print("Сума двох чисел:", sum_result)

# Завдання 3. Обчислити площу прямокутника за заданими сторонами.
# 1) Введення двох значень сторін прямокутника користувачем
length = float(input("Введіть розмір довжини прямокутника: "))
width = float(input("Введіть розмір ширини прямокутника: "))
# 2) Обчислення суми
area = length * width
area1 = round(area, 3)
# 3) Виведення результату
print("Площа прямокутника:", area1)

# Завдання 4. Вивести на екран таблицю множення на 7.
# 1) Запис алгоритму розрухунку
for i in range(1, 10):
    result = 7 * i
# 2) Відображення результатів
    print("7 *", i, "=", result)

# Завдання 5. Знайти найбільший спільний дільник двох чисел.
# 1) Запис алгоритму розрахунку
def gcd(a, b):
    while b:
        a, b = b, a % b
    return a
# 2) Введення двох чисел користувачем
num1 = int(input("Введіть перше число: "))
num2 = int(input("Введіть друге число: "))
# 3) Знаходження найбільшого спільного дільника
result = gcd(num1, num2)
# 4) Відображення результату
print("Найбільший спільний дільник:", result)

# Завдання 6. Перевести температуру з Цельсія в Фаренгейти.
# 1) Введення температури в градусах Цельсія користувачем
celsius = float(input("Введіть температуру в градусах Цельсія: "))
# 2) Конвертація значення температури в градусах Фаренгейта
fahrenheit = (celsius * 9/5) + 32
# 3) Виведення результату
print("Температура в градусах Фаренгейта:", fahrenheit)

# Завдання 7. Порахувати факторіал заданого числа.
# 1 етап: Описати функцію для розрахунку факторіала
def factorial(n):
    if n == 0 or n == 1:
        return 1
    else:
        return n * factorial(n - 1)
# 2 етап: Введення числа користувачем
num = int(input("Введіть число: "))
# 3 етап: Розрахунок факторіала
result = factorial(num)
# 4 етап: Виведення результату
print("Факторіал числа", num, "дорівнює", result)

