-- Active: 1702291972698@@127.0.0.1@5432@sampleis@public
-- Додати категорії
INSERT INTO categories (category_name) VALUES
    ('Робота'),
    ('Особисте'),
    ('Покупки'),
    ('Здоров`я');


-- Додати завдання
INSERT INTO tasks (category_id, task_name, task_description, due_date, completed) VALUES
    (1, 'Завершити звіт', 'Завершити звіт для клієнта X', '2024-03-15', FALSE),
    (1, 'Зустріч з колегами', 'Провести зустріч з командою', '2024-02-20', FALSE),
    (2, 'Зробити покупки', 'Купити продукти для дому', '2024-02-10', FALSE),
    (3, 'Замовити новий телефон', 'Замовити iPhone 14 Pro', '2024-02-28', FALSE),
    (4, 'Займатися спортом', 'Піти на тренування в спортзал', '2024-02-15', FALSE);

